In [4]:
import pandas as pd 
import numpy as np

In [21]:
def read_csv(csv_url):
    return pd.read_csv(csv_url)

In [39]:
df_unpaid_care_work = read_csv('data/1-female-to-male-ratio-of-time-devoted-to-unpaid-care-work.csv')

In [6]:
df_unpaid_care_work.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 69 entries, 0 to 68
Data columns (total 4 columns):
 #   Column                                                                  Non-Null Count  Dtype
---  ------                                                                  --------------  -----
 0   Entity                                                                  69 non-null     object
 1   Code                                                                    68 non-null     object
 2   Year                                                                    69 non-null     int64
 3   Female to male ratio of time devoted to unpaid care work (OECD (2014))  69 non-null     float64
dtypes: float64(1), int64(1), object(2)
memory usage: 2.3+ KB

In [8]:
df_unpaid_care_work.head()

,Entity,Code,Year,Female to male ratio of time devoted to unpaid care work (OECD (2014))
0,Albania,ALB,2014,7.21
1,Algeria,DZA,2014,6.75
2,Argentina,ARG,2014,2.88
3,Armenia,ARM,2014,5.24
4,Australia,AUS,2014,1.81

In [17]:
# All the countries are unique
# There 69 countries
df_unpaid_care_work['Entity'].nunique()

69

In [18]:
# Data only contains information about 2014
df_unpaid_care_work.describe()

,Year,Female to male ratio of time devoted to unpaid care work (OECD (2014))
count,69.0,69.000000
mean,2014.0,3.248696
std,0.0,2.510711
min,2014.0,1.180000
25%,2014.0,1.810000
50%,2014.0,2.530000
75%,2014.0,3.380000
max,2014.0,17.290000

In [22]:
df_income = read_csv('data/2-share-of-women-in-top-income-groups.csv')

In [23]:
df_income.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 168 entries, 0 to 167
Data columns (total 9 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Entity                       168 non-null    object
 1   Code                         148 non-null    object
 2   Year                         168 non-null    int64
 3   Share of women in top 0.1%   131 non-null    float64
 4   Share of women in top 0.25%  37 non-null     float64
 5   Share of women in top 0.5%   82 non-null     float64
 6   Share of women in top 1%     167 non-null    float64
 7   Share of women in top 10%    168 non-null    float64
 8   Share of women in top 5%     168 non-null    float64
dtypes: float64(6), int64(1), object(2)
memory usage: 11.9+ KB

In [25]:
df_income.head()

,Entity,Code,Year,Share of women in top 0.1%,Share of women in top 0.25%,Share of women in top 0.5%,Share of women in top 1%,Share of women in top 10%,Share of women in top 5%
0,Australia,AUS,2000,14.2,NaN,NaN,18.3,24.9,21.1
1,Australia,AUS,2001,13.2,NaN,NaN,18.4,25.1,21.4
2,Australia,AUS,2002,13.5,NaN,NaN,18.8,25.1,21.5
3,Australia,AUS,2003,14.4,NaN,NaN,19.1,25.1,21.6
4,Australia,AUS,2004,15.2,NaN,NaN,19.6,25.5,22.2

In [26]:
df_income.groupby(by='Entity').count()

,Code,Year,Share of women in top 0.1%,Share of women in top 0.25%,Share of women in top 0.5%,Share of women in top 1%,Share of women in top 10%,Share of women in top 5%
Entity,,,,,,,,
Australia,15,15,14,0,0,15,15,15
Canada,23,23,23,0,0,23,23,23
Denmark,34,34,34,0,0,34,34,34
Italy,17,17,17,17,17,17,17,17
New Zealand,36,36,0,0,22,35,36,36
Norway,8,8,8,0,8,8,8,8
Spain,15,15,15,0,15,15,15,15
UK,0,20,20,20,20,20,20,20

In [27]:
df_ratio_labor = read_csv('data/3-ratio-of-female-to-male-labor-force-participation-rates-ilo-wdi.csv')

In [30]:
df_ratio_labor.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6432 entries, 0 to 6431
Data columns (total 4 columns):
 #   Column                                                                             Non-Null Count  Dtype
---  ------                                                                             --------------  -----
 0   Entity                                                                             6432 non-null   object
 1   Code                                                                               5984 non-null   object
 2   Year                                                                               6432 non-null   int64
 3   Ratio of female to male labor force participation rate (%) (modeled ILO estimate)  6432 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 201.1+ KB

In [31]:
df_ratio_labor.head()

,Entity,Code,Year,Ratio of female to male labor force participation rate (%) (modeled ILO estimate)
0,Afghanistan,AFG,1990,19.604805
1,Afghanistan,AFG,1991,19.713380
2,Afghanistan,AFG,1992,19.803307
3,Afghanistan,AFG,1993,19.844606
4,Afghanistan,AFG,1994,19.884710

In [32]:
df_ratio_labor.groupby(by="Entity").count()

,Code,Year,Ratio of female to male labor force participation rate (%) (modeled ILO estimate)
Entity,,,
Afghanistan,32,32,32
Albania,32,32,32
Algeria,32,32,32
Angola,32,32,32
Argentina,32,32,32
...,...,...,...
West Bank and Gaza,0,32,32
World,32,32,32
Yemen,32,32,32
Zambia,32,32,32
Zimbabwe,32,32,32

In [33]:
df_ratio_labor.groupby(by="Year").count()

,Entity,Code,Ratio of female to male labor force participation rate (%) (modeled ILO estimate)
Year,,,
1990,201,187,201
1991,201,187,201
1992,201,187,201
1993,201,187,201
1994,201,187,201
1995,201,187,201
1996,201,187,201
1997,201,187,201
1998,201,187,201
1999,201,187,201
2000,201,187,201
2001,201,187,201
2002,201,187,201
2003,201,187,201
2004,201,187,201
2005,201,187,201
2006,201,187,201
2007,201,187,201
2008,201,187,201
2009,201,187,201
2010,201,187,201
2011,201,187,201
2012,201,187,201
2013,201,187,201
2014,201,187,201
2015,201,187,201
2016,201,187,201
2017,201,187,201
2018,201,187,201
2019,201,187,201
2020,201,187,201
2021,201,187,201

In [34]:
df_unpaid_care_work_2 =read_csv('data/4-female-to-male-ratio-of-time-devoted-to-unpaid-care-work.csv')

In [35]:
df_unpaid_care_work_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 69 entries, 0 to 68
Data columns (total 4 columns):
 #   Column                                                                  Non-Null Count  Dtype
---  ------                                                                  --------------  -----
 0   Entity                                                                  69 non-null     object
 1   Code                                                                    68 non-null     object
 2   Year                                                                    69 non-null     int64
 3   Female to male ratio of time devoted to unpaid care work (OECD (2014))  69 non-null     float64
dtypes: float64(1), int64(1), object(2)
memory usage: 2.3+ KB

In [36]:
df_unpaid_care_work_2.describe()

,Year,Female to male ratio of time devoted to unpaid care work (OECD (2014))
count,69.0,69.000000
mean,2014.0,3.248696
std,0.0,2.510711
min,2014.0,1.180000
25%,2014.0,1.810000
50%,2014.0,2.530000
75%,2014.0,3.380000
max,2014.0,17.290000

In [46]:
df_unpaid_care_work_2.isnull().sum().sort_values(ascending=False)

Code                                                                      1
Entity                                                                    0
Year                                                                      0
Female to male ratio of time devoted to unpaid care work (OECD (2014))    0
dtype: int64

In [58]:
# It seems two datasets are the same 
# Because there is one null value code returns false
(df_unpaid_care_work_2 == df_unpaid_care_work).all()

Entity                                                                     True
Code                                                                      False
Year                                                                       True
Female to male ratio of time devoted to unpaid care work (OECD (2014))     True
dtype: bool

In [59]:
# Deleting one of the dataframes because it already exists
del df_unpaid_care_work_2

In [62]:
df_maternal_mortality = read_csv('data/5-maternal-mortality.csv')

In [63]:
df_maternal_mortality.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5800 entries, 0 to 5799
Data columns (total 4 columns):
 #   Column                                                             Non-Null Count  Dtype
---  ------                                                             --------------  -----
 0   Entity                                                             5800 non-null   object
 1   Code                                                               5548 non-null   object
 2   Year                                                               5800 non-null   int64
 3   Maternal Mortality Ratio (Gapminder (2010) and World Bank (2015))  5800 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 181.4+ KB

In [64]:
df_maternal_mortality.head()

,Entity,Code,Year,Maternal Mortality Ratio (Gapminder (2010) and World Bank (2015))
0,Afghanistan,AFG,2000,1450.0
1,Afghanistan,AFG,2001,1390.0
2,Afghanistan,AFG,2002,1300.0
3,Afghanistan,AFG,2003,1240.0
4,Afghanistan,AFG,2004,1180.0

In [66]:
df_maternal_mortality.groupby(by='Entity').count()

,Code,Year,Maternal Mortality Ratio (Gapminder (2010) and World Bank (2015))
Entity,,,
Afghanistan,18,18,18
Albania,18,18,18
Algeria,18,18,18
Angola,18,18,18
Antigua and Barbuda,18,18,18
...,...,...,...
Vietnam,18,18,18
World,18,18,18
Yemen,18,18,18
Zambia,18,18,18
Zimbabwe,18,18,18

In [67]:
df_maternal_mortality.groupby(by='Year').count()

,Entity,Code,Maternal Mortality Ratio (Gapminder (2010) and World Bank (2015))
Year,,,
1751,2,2,2
1752,2,2,2
1753,2,2,2
1754,2,2,2
1755,2,2,2
...,...,...,...
2016,200,186,200
2017,200,186,200
2018,35,35,35
2019,32,32,32
2020,25,25,25

In [69]:
df_gender_gap_wage = read_csv('data/6-gender-gap-in-average-wages-ilo.csv')

In [70]:
df_gender_gap_wage.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 413 entries, 0 to 412
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Entity               413 non-null    object
 1   Code                 413 non-null    object
 2   Year                 413 non-null    int64
 3   Gender wage gap (%)  413 non-null    float64
dtypes: float64(1), int64(1), object(2)
memory usage: 13.0+ KB

In [72]:
df_gender_gap_wage.head()

      Entity Code  Year  Gender wage gap (%)
0  Argentina  ARG  1986                15.79
1  Argentina  ARG  1987                12.50
2  Argentina  ARG  1988                11.31
3  Argentina  ARG  1991                 6.71
4  Argentina  ARG  1992                 8.33

In [71]:
df_gender_gap_wage.describe()

              Year  Gender wage gap (%)
count   413.000000           413.000000
mean   2005.159806            10.886949
std       7.820724            10.241873
min    1981.000000           -28.270000
25%    2000.000000             3.920000
50%    2006.000000            10.680000
75%    2012.000000            17.630000
max    2016.000000            35.750000

In [73]:
df_gender_gap_wage.groupby(by='Year').count()

      Entity  Code  Gender wage gap (%)
Year
1981       1     1                    1
1982       1     1                    1
1983       1     1                    1
1984       1     1                    1
1985       1     1                    1
1986       2     2                    2
1987       2     2                    2
1988       2     2                    2
1989       6     6                    6
1990       4     4                    4
1991       4     4                    4
1992       9     9                    9
1993       7     7                    7
1994       5     5                    5
1995       7     7                    7
1996       9     9                    9
1997      11    11                   11
1998      12    12                   12
1999      12    12                   12
2000      12    12                   12
2001      15    15                   15
2002      25    25                   25
2003      12    12                   12
2004      12    12                   12
2005      14    14                   14
2006      26    26                   26
2007      13    13                   13
2008      15    15                   15
2009      17    17                   17
2010      28    28                   28
2011      16    16                   16
2012      18    18                   18
2013      19    19                   19
2014      51    51                   51
2015      13    13                   13
2016      10    10                   10

In [74]:
df_gender_gap_wage.groupby(by='Entity').count()

                Code  Year  Gender wage gap (%)
Entity
Argentina         27    27                   27
Austria            4     4                    4
Belgium            4     4                    4
Belize             6     6                    6
Bolivia           15    15                   15
...              ...   ...                  ...
Turkey             1     1                    1
United Kingdom     2     2                    2
Uruguay           21    21                   21
Venezuela         13    13                   13
Vietnam            2     2                    2

[64 rows x 3 columns]

In [75]:
df_labor_entp =read_csv('data/Labor-Force-Women-Entrpreneurship.csv')

In [78]:
df_labor_entp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 1 columns):
 #   Column                                                                                                                                                                       Non-Null Count  Dtype
---  ------                                                                                                                                                                       --------------  -----
 0   No;Country;Level of development;European Union Membership;Currency;Women Entrepreneurship Index;Entrepreneurship Index;Inflation rate;Female Labor Force Participation Rate  51 non-null     object
dtypes: object(1)
memory usage: 540.0+ bytes

In [79]:
df_labor_entp.head()

  No;Country;Level of development;European Union Membership;Currency;Women Entrepreneurship Index;Entrepreneurship Index;Inflation rate;Female Labor Force Participation Rate
0  4;Austria;Developed;Member;Euro;54.9;64.9;0.9;...
1   6;Belgium;Developed;Member;Euro;63.6;65.5;0.6;58
2  17;Estonia;Developed;Member;Euro;55.4;60.2;-0....
3  18;Finland;Developed;Member;Euro;66.4;65.7;-0....
4   19;France;Developed;Member;Euro;68.8;67.3;0;60.6

In [80]:
df_labor_entp =pd.read_csv('data/Labor-Force-Women-Entrpreneurship.csv',sep=';')

In [81]:
df_labor_entp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 9 columns):
 #   Column                                 Non-Null Count  Dtype
---  ------                                 --------------  -----
 0   No                                     51 non-null     int64
 1   Country                                51 non-null     object
 2   Level of development                   51 non-null     object
 3   European Union Membership              51 non-null     object
 4   Currency                               51 non-null     object
 5   Women Entrepreneurship Index           51 non-null     float64
 6   Entrepreneurship Index                 51 non-null     float64
 7   Inflation rate                         51 non-null     float64
 8   Female Labor Force Participation Rate  51 non-null     float64
dtypes: float64(4), int64(1), object(4)
memory usage: 3.7+ KB

In [82]:
df_labor_entp.head()

,No,Country,Level of development,European Union Membership,Currency,Women Entrepreneurship Index,Entrepreneurship Index,Inflation rate,Female Labor Force Participation Rate
0,4,Austria,Developed,Member,Euro,54.9,64.9,0.90,67.1
1,6,Belgium,Developed,Member,Euro,63.6,65.5,0.60,58.0
2,17,Estonia,Developed,Member,Euro,55.4,60.2,-0.88,68.5
3,18,Finland,Developed,Member,Euro,66.4,65.7,-0.20,67.7
4,19,France,Developed,Member,Euro,68.8,67.3,0.00,60.6

In [83]:
df_labor_entp.describe()

,No,Women Entrepreneurship Index,Entrepreneurship Index,Inflation rate,Female Labor Force Participation Rate
count,51.000000,51.000000,51.000000,51.000000,51.000000
mean,29.980392,47.835294,47.241176,2.587647,58.481765
std,18.017203,14.268480,16.193149,5.380639,13.864567
min,1.000000,25.300000,24.800000,-2.250000,13.000000
25%,14.500000,36.350000,31.900000,-0.500000,55.800000
50%,30.000000,44.500000,42.700000,0.600000,61.000000
75%,45.500000,59.150000,65.400000,3.600000,67.400000
max,60.000000,74.800000,77.600000,26.500000,82.300000

In [ ]:
read_csv()